{
  "backend/main.mo": "Minimal Motoko actor with no functionality.",
  "feature_evidence.json": "Feature evidence metadata describing added gallery images and related frontend file changes.",
  "frontend-file-summaries.txt": "Prewritten summaries of all main frontend components and utilities in the project.",
  "frontend/index.css": "Root Tailwind and CSS variable definitions for light/dark themes and global styling.",
  "frontend/index.html": "Base HTML entry point loading the SPA root and main script.",
  "frontend/src/App.tsx": "Main React component composing all site sections, background, audio toggle, and surprise button.",
  "frontend/src/components/AudioPlayerToggle.tsx": "Audio control button that initializes, plays, and mutes background music.",
  "frontend/src/components/background/RomanticBackground.tsx": "Canvas‑based falling petal animation with layered background images and gradients.",
  "frontend/src/components/CountdownTimer.tsx": "Displays time remaining until Valentine’s Day using values from a custom countdown hook.",
  "frontend/src/components/Footer.tsx": "Footer showing a love dedication with animated heart icons.",
  "frontend/src/components/gallery/FramedGalleryImage.tsx": "Image component with heart‑frame overlay, fade‑in, and hover zoom effects.",
  "frontend/src/components/sections/CountdownSection.tsx": "Section revealing a countdown card with scroll‑triggered fade‑in animation.",
  "frontend/src/components/sections/GallerySection.tsx": "Gallery section rendering six generated images plus two user‑uploaded photos in animated frames.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with intersection-based fade-in animation showing hearts, a title, and subtitle.",
  "frontend/src/components/sections/LoveMessageSection.tsx": "Section that reveals a styled love letter card when scrolled into view.",
  "frontend/src/components/sections/ReasonsSection.tsx": "Animated accordion listing multiple reasons for love, revealed on scroll.",
  "frontend/src/components/SurpriseButton.tsx": "Button that opens the romantic surprise modal when clicked.",
  "frontend/src/components/SurpriseModal.tsx": "Modal dialog showing a special Valentine message with animated hearts.",
  "frontend/src/hooks/useActor.ts": "React hook creating and managing a backend actor tied to Internet Identity, invalidating dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and provider for managing Internet Identity login state, identity loading, and authentication actions.",
  "frontend/src/hooks/useQueries.ts": "Placeholder file exporting nothing because no backend queries are needed.",
  "frontend/src/hooks/useValentinesCountdown.ts": "Hook computing a live countdown to the next Valentine’s Day, updating every second.",
  "frontend/src/index.css": "Tailwind base plus custom romantic color palette, themes, and component utility classes.",
  "frontend/src/main.tsx": "App entry point setting up React Query, Internet Identity provider, and rendering the app.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, animations, fonts, and plugins for a themed, animated UI.",
  "project_state.json": "Defines the project’s state, features, and design goals for a romantic Valentine’s Day single‑page website."
}