{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report documenting two high-confidence features: adding two uploaded photos to the gallery and arranging all gallery photos in an organized grid layout.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files describing components, hooks, and configuration for a Valentine's Day single-page website.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining a romantic color palette and theme tokens for both light and dark modes.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tags and a root div for mounting the app.",
  "frontend/src/App.tsx": "Main application component that renders all sections (hero, love message, gallery, reasons, countdown) with romantic background, audio player, and surprise button.",
  "frontend/src/components/AudioPlayerToggle.tsx": "Fixed audio player toggle button with mute/unmute functionality and an info popover explaining the royalty-free music substitute and how to replace it.",
  "frontend/src/components/background/RomanticBackground.tsx": "Animated background component rendering falling heart-shaped petals on HTML5 canvas with gradient overlay and background image.",
  "frontend/src/components/CountdownTimer.tsx": "Countdown timer display component showing days, hours, minutes, and seconds until Valentine's Day in a responsive grid with animated hearts.",
  "frontend/src/components/Footer.tsx": "Footer component displaying a love message for Numa Sharma with animated heart icons.",
  "frontend/src/components/gallery/FramedGalleryImage.tsx": "Reusable gallery image component with heart frame overlay, hover scale effects, glow border, and staggered fade-in animation support.",
  "frontend/src/components/sections/CountdownSection.tsx": "Section wrapper for the countdown timer with intersection observer for scroll-triggered fade-in animation and romantic card styling.",
  "frontend/src/components/sections/GallerySection.tsx": "Displays a grid of 12 gallery images with intersection observer for fade-in animation. Uses FramedGalleryImage component with staggered delays for each image.",
  "frontend/src/components/sections/HeroSection.tsx": "Hero section with animated heart icons, large cursive name \"Numa Sharma\", and subtitle \"My Forever Valentine\". Includes intersection observer for fade-in effect.",
  "frontend/src/components/sections/LoveMessageSection.tsx": "Displays a romantic love letter in a styled card with serif typography and first-letter drop cap. Uses intersection observer for scroll-triggered animation.",
  "frontend/src/components/sections/ReasonsSection.tsx": "Accordion component listing 12 reasons for love, each with a heart icon. Uses intersection observer and includes expandable content for each reason.",
  "frontend/src/components/SurpriseButton.tsx": "Large sparkle-decorated button that opens a surprise modal with romantic styling and hover effects.",
  "frontend/src/components/SurpriseModal.tsx": "Modal dialog component displaying a special romantic message for Numa Sharma using shadcn Dialog with animated hearts.",
  "frontend/src/constants/audio.ts": "Exports audio configuration constants including the background music path, loop setting, and default volume (0.3).",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages an ICP actor instance based on Internet Identity authentication state. Invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context provider and hook for Internet Identity authentication, managing login state, identity storage, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file with no backend queries, as this is a frontend-only application.",
  "frontend/src/hooks/useValentinesCountdown.ts": "Custom hook that calculates and returns countdown time (days, hours, minutes, seconds) to next Valentine's Day, updating every second.",
  "frontend/src/index.css": "Tailwind CSS configuration with romantic Valentine's Day color palette (blush, rose, champagne), custom glow effects, shadows, and gradient backgrounds for love-themed styling.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component into the root DOM element.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration file defining custom color schemes (including romantic-themed colors using oklch), typography, animations (accordion, float, pulse-glow), container settings, and extended theme properties for a styled UI.",
  "project_state.json": "Project state metadata for a Valentine's Day Website tracking two completed features: adding uploaded photos to a gallery and arranging them in a grid layout."
}